{
  "profile": {
    "name": "Rafael Mendes",
    "title": "Senior Software Engineer",
    "location": "Cork, Ireland",
    "yearsOfExperience": 16,
    "summary": "Experienced Brazilian Software Engineer with 16+ years in agile development. Known for clean code, strong documentation, and a passion for learning. Seeking new challenges with a great team at an exceptional company.",
    "website": "https://strubloid.com",
    "github": "https://github.com/strubloid",
    "email": "joserafaelmb@gmail.com",
    "languages": [
      { "name": "Portuguese", "level": "Native" },
      { "name": "English", "level": "Native" },
      { "name": "Italian", "level": "Intermediate" },
      { "name": "French", "level": "Beginner" },
      { "name": "Japanese", "level": "Beginner" }
    ]
  },
  "skills": [
    {
      "id": "about",
      "icon": "now-ui-icons users_single-02",
      "title": "A little bit about me",
      "accent": "accent",
      "description": "Born into brush strokes and colour palettes, I danced between paint and canvas until binary whispers and the elegance of code seduced my soul. 🎨→💻 Now, as a Brazilian Software Engineer with 16+ years of crafting digital experiences, I blend artistic sensibility with technical precision—building clean architectures, pixel-perfect interfaces, and systems that feel alive.\n\nWhen I'm not architecting code, you'll find me chasing light through a camera lens 📸, strumming guitars into the night 🎸, or curating moments of beauty that have graced exibit into galleries from the Louvre to the streets of João Pessoa. I believe great software—like great art tells a story, stirs emotion, and leaves the world slightly more beautiful.\n\nDesign patterns are poetry. Linux is freedom. And every line of code is a brushstroke in something larger. Let's build something extraordinary together. 🚀",
      "description_short": "Brazilian Software Engineer with 16+ years crafting digital experiences. Artist, guitarist, photographer. Blending clean code with creative passion. 🎨💻"
    },
    {
      "id": "react",
      "icon": "now-ui-icons education_paper",
      "title": "React & Next.js",
      "accent": "info",
      "description": "React has been my frontend evolution, starting from Node.js and maturing through React 18, React Native 0.74, Next.js 13/14, and Expo. I follow SOLID principles, build reusable component architectures, and manage state with React Query, TanStack Table, React Hook Form, and Context API. I deliver pixel-perfect Figma-to-code implementations with consistent typography, spacing, and theming.",
      "description_short": "Frontend expert with React 18, Next.js, React Native, and Expo. Building scalable, performant applications with clean component architectures.",
      "usages": [
        {
          "company": "Konvi",
          "period": "2025 - Present",
          "detail": "Leading migration of internal packages in a monorepo using React 18, React Native 0.74, Next.js 13/14, and Expo. Built cross-platform features with TanStack React Query, TanStack Table, React Hook Form. Implemented enterprise-grade design systems with DatoCMS integration and OAuth 2.0 providers."
        },
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Developed high-performance React applications for a no-code platform. Designed reusable component architectures and implemented charting libraries (Chart.js, D3.js) for admin dashboards. Migrated codebases to TypeScript and developed reusable npm packages."
        },
        {
          "project": "Bazinga - LLM Developer",
          "period": "2019 - Present",
          "detail": "Built full-stack Next.js app with user auth and /dashboard landing. Implemented Jobs workflow: list view, detail view, multi-step accordion for Base CV upload and Job Description. Integrated OpenAI for auto-generating tailored CVs and Cover Letters with downloadable PDFs."
        },
        {
          "company": "Captura.Me",
          "period": "Dec 2012 - Sep 2016",
          "detail": "Introduced React as core frontend technology, replacing legacy Zend views. Built scalable component architecture with React Router for client-side navigation. Managed complex state with Context API and custom hooks. Applied code-splitting and lazy loading for performance optimization."
        }
      ],
      "relatedSkills": ["TypeScript", "Node.js", "Next.js", "React Query", "Design Systems"]
    },
    {
      "id": "typescript",
      "icon": "now-ui-icons design-2_html5",
      "title": "TypeScript",
      "accent": "info",
      "description": "TypeScript 5+ is my standard for all frontend and backend work. I enforce type safety across monorepos, migrate legacy JavaScript codebases, and build typed interfaces for REST APIs, GraphQL schemas, and component libraries. Strong typing has been essential in maintaining quality across large-scale applications.",
      "description_short": "TypeScript 5+ standard for type-safe development. REST APIs, GraphQL, component libraries. Modernizing legacy JavaScript codebases.",
      "usages": [
        {
          "company": "Konvi",
          "period": "2025 - Present",
          "detail": "Using TypeScript 5+ across React 18, React Native, and Next.js applications. Enforced type safety in monorepo structure, built typed interfaces for GraphQL APIs, OAuth integrations, and blockchain (ERC-20/721) wallet interactions."
        },
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Migrated large Angular and React codebases from JavaScript to TypeScript. Built strongly-typed npm packages and established TypeScript standards across the team. Created typed interfaces for REST APIs and database schemas with Prisma."
        },
        {
          "company": "Monsoon Consulting",
          "period": "Apr 2019 - May 2020",
          "detail": "Introduced TypeScript to Magento II project, building typed interfaces for REST APIs and custom modules. Improved developer experience with IDE autocompletion and compile-time error checking."
        }
      ],
      "relatedSkills": ["React", "Node.js", "GraphQL", "Jest", "Prisma"]
    },
    {
      "id": "php",
      "icon": "now-ui-icons education_atom",
      "title": "PHP",
      "accent": "brazil-green",
      "description": "PHP has been a serious relationship since 2007, spanning pure PHP, Yii, Zend Framework I & II, Magento 1 & 2, and Laravel. In May 2010, I told Rasmus Lerdorf at IV ENSOL that I'd keep using PHP — 16 years later, it remains a core part of my backend expertise.",
      "description_short": "Serious backend relationship since 2007. Pure PHP, Yii, Zend, Laravel. E-commerce, REST APIs, database architectures.",
      "usages": [
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Built backend services in Laravel for a no-code platform. Designed REST APIs for complex workflows, integrated third-party services, and managed database operations with optimization and caching strategies."
        },
        {
          "company": "Monsoon Consulting",
          "period": "Apr 2019 - May 2020",
          "detail": "Maintained and enhanced Magento 1 and 2 e-commerce applications. Designed custom modules, REST APIs, and conducted performance audits. Identified bottlenecks in third-party integrations and delivered improvement plans."
        },
        {
          "company": "StudioForty9",
          "period": "Sep 2016 - Dec 2018",
          "detail": "Redesigned Magento 1 architecture to support promotional behavior. Developed backend system for promotional item management and cross-sell relationships. Built tools for structural issue identification and image asset optimization."
        },
        {
          "company": "Vox Technology",
          "period": "Aug 2011 - Nov 2012",
          "detail": "Led migration of legacy backend to Zend Framework 1. Refactored 200+ templates with REGEX patterns, improving consistency and maintainability. Mentored frontend team via pair programming."
        },
        {
          "company": "Dantel",
          "period": "Aug 2011 - Nov 2012",
          "detail": "Developed core backend for e-procurement platform using PHP and YII framework. Refactored Customer Support system with pattern-based architecture. Built custom JavaScript runtime importer for dynamic library loading."
        }
      ],
      "relatedSkills": ["Magento", "Zend Framework", "Laravel", "REST APIs", "MySQL", "Docker"]
    },
    {
      "id": "python",
      "icon": "now-ui-icons education_atom",
      "title": "Python",
      "accent": "brazil-gold",
      "description_short": "University to production. 20+ games with Pygame, FastAPI, AWS, critical backup systems, AI integrations.",
      "description": "Python has been with me since university, where I built 20+ 2D games with Pygame as part of the Firestorm team. Today I use it for backend services with FastAPI, AI integrations via the OpenAI API, critical backup systems, and automation tools. My Sperm Whale project demonstrates real-time transcription and translation using Whisper and multi-engine AI.",
      "usages": [
        {
          "project": "Spermwhale - AI Transcription System",
          "period": "2022 - Present",
          "detail": "Architected real-time transcription and audio processing system with WebSocket-driven feedback. Integrated AI-based audio analysis with Whisper for automatic speech recognition. Implemented asset management and caching inspired by game-engine rendering loops for performance optimization."
        },
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Developed Python backend services for critical tasks. Created backup and reporting systems, AWS server-side scripting, and diagnostic tools. Evolved BashAliases fork with AI-powered diagnostics for Linux server maintenance."
        },
        {
          "project": "BashAliases - Shell Automation Toolkit",
          "period": "2013 - Present",
          "detail": "Evolved from simple Linux aliases into a complete system setup framework. Engineered advanced shell scripting utilities using Bash and Python with OOP design principles. Integrated OpenAI API for intelligent, context-aware scripting directly from the terminal."
        }
      ],
      "relatedSkills": ["Bash", "FastAPI", "OpenAI API", "WebSocket", "AWS", "Docker"]
    },
    {
      "id": "bash",
      "icon": "now-ui-icons text_bold",
      "title": "Bash & Linux",
      "accent": "brazil-gold",
      "description_short": "Linux love since 2005. Shell scripting, server automation, AWS, CI/CD pipelines, intelligent terminal workflows.",
      "description": "Bash scripting is pure Linux love, inherited from the GNU/Linux community. Since 2005, I've written scripts for server automation, AWS management, CI/CD pipelines, rollback procedures, and AI-powered diagnostics. My .bash_aliases project evolved into a cross-platform toolkit integrating Python and OpenAI for intelligent scripting.",
      "usages": [
        {
          "project": "BashAliases - Cross-Platform Toolkit",
          "period": "2013 - Present",
          "detail": "Created comprehensive automation toolkit with advanced Bash and Python utilities. Engineered custom installers and environment bootstraps for Linux, macOS, and Windows (WSL). Integrated OpenAI API for intelligent terminal scripting and context-aware command generation."
        },
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Developed Bash scripts for AWS server-side scripting, CI/CD pipelines, and rollback procedures. Created specialized fork of bash_aliases with AI-powered diagnostics for Linux environment maintenance and rapid troubleshooting."
        },
        {
          "company": "Community Leadership",
          "period": "2005 - Present",
          "detail": "Active in GNU/Linux community since 2005. Organized events and promoted free software through GLUGPB & CETI groups. Advocated for Linux best practices and open-source culture across the Northeast Brazil developer community."
        }
      ],
      "relatedSkills": ["Python", "Docker", "AWS", "Git", "Linux Server Administration"],
      "link": {
        "text": "Check it out",
        "url": "https://github.com/strubloid/.bash_aliases"
      }
    },
    {
      "id": "angular",
      "icon": "now-ui-icons ui-2_settings-90",
      "title": "Angular",
      "accent": "accent",
      "description": "Led frontend development with Angular 19 at Blocworx, building a high-performance no-code platform. I introduced standardised testing with Jest and Puppeteer, migrated codebases to TypeScript, and developed reusable npm packages. Implemented charting libraries like Chart.js and D3.js for complex workflow visualisation in admin dashboards.",
      "description_short": "Angular 19 frontend expert. High-performance no-code platforms, Jest & Puppeteer testing, reusable npm packages.",
      "usages": [
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Led frontend development with Angular 19 for a high-performance no-code platform. Introduced standardised testing framework with Jest and Puppeteer. Migrated large codebases to TypeScript, enforcing type safety across the team. Developed reusable npm packages for internal use and open-source contribution."
        },
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Implemented advanced charting libraries including Chart.js and D3.js for complex workflow visualization in admin dashboards. Designed responsive design systems aligned with Figma specifications. Built dynamic data tables with TanStack Table for enterprise applications."
        }
      ],
      "relatedSkills": ["TypeScript", "Jest", "Puppeteer", "Chart.js", "D3.js", "Responsive Design"]
    },
    {
      "id": "java",
      "icon": "now-ui-icons ui-2_settings-90",
      "title": "Java",
      "accent": "brazil-green",
      "description": "My Java journey includes optimising backend processing for Brazil's BGSD supercomputer at Dataprev, cutting batch times from 0.01s to 0.00001s. I refactored legacy academic models into high-performance big data solutions. As an OSUM Leader, I organised events promoting Java best practices across Brazil.",
      "description_short": "Backend optimization for BGSD supercomputer. 1000x performance improvement. Big Data, OSUM leadership.",
      "usages": [
        {
          "company": "Dataprev",
          "period": "Apr 2009 - Apr 2010",
          "detail": "Optimised Java backend processing for Brazil's BGSD (Brazilian Budget Supervision Distribution) supercomputer. Refactored legacy academic models based on Japanese theory into high-performance big data solutions, reducing batch processing time from 0.01s to 0.00001s — a 1000x improvement."
        },
        {
          "company": "Dataprev",
          "period": "Apr 2009 - Apr 2010",
          "detail": "Built frontend components using the in-house Netuno framework. Focused on responsive UI design and computational efficiency to support the supercomputer's heavy workloads. Contributed to cost reduction through enhanced processing efficiency."
        },
        {
          "company": "OSUM Leader - Community",
          "period": "2009 - 2010",
          "detail": "Organized events promoting Java best practices and the latest tools across Brazil. Showcased Sun Spot innovations at major conferences, fostering a vibrant developer community focused on Java excellence and emerging technologies."
        }
      ],
      "relatedSkills": ["Big Data", "Performance Optimization", "Netuno Framework", "Multithreading"]
    },
    {
      "id": "devops",
      "icon": "now-ui-icons tech_laptop",
      "title": "DevOps & Tools",
      "accent": "accent",
      "description": "Docker, Git-flow, CI/CD pipelines, and Linux server administration are core to my workflow. I build containerised development environments, manage AWS scripting, and enforce code quality through ESLint, Prettier, and thorough code reviews. I use Turborepo for monorepo management and Webpack 5 for build optimisation.",
      "description_short": "Docker, Git-flow, CI/CD pipelines, Linux admin. Containerized dev, AWS, code quality enforcement.",
      "usages": [
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Designed and implemented comprehensive CI/CD pipelines using Docker for local and staging environments. Created Docker containers and docker-compose configurations for app + MongoDB. Enforced code quality through ESLint, Prettier, and rigorous code reviews. Developed specialized Bash scripts for AWS server-side management."
        },
        {
          "company": "Konvi",
          "period": "2025 - Present",
          "detail": "Managing DevOps for monorepo structure using Turborepo. Implementing CI/CD workflows for React, React Native, and Next.js applications. Handling containerization and deployment optimization across multiple platforms."
        },
        {
          "company": "Monsoon Consulting",
          "period": "Apr 2019 - May 2020",
          "detail": "Implemented Docker-based workflows for local, stage, and live environments in Magento projects. Enforced Git Flow version control practices. Established standardised code review processes ensuring all changes met quality standards before deployment."
        },
        {
          "project": "BashAliases - DevOps Toolkit",
          "period": "2013 - Present",
          "detail": "Created cross-platform toolkit for developer productivity with advanced Bash scripting. Engineered custom installers and environment bootstraps. Integrated with Git for version control and included AI-powered diagnostics using OpenAI API."
        }
      ],
      "relatedSkills": ["Docker", "Git", "AWS", "Bash", "Turborepo", "Webpack 5"]
    },
    {
      "id": "databases",
      "icon": "now-ui-icons shopping_credit-card",
      "title": "Databases & APIs",
      "accent": "info",
      "description": "Experience across Firebase, MongoDB, MySQL, PostgreSQL, Redis, and Oracle. I design and consume REST APIs and GraphQL endpoints, integrate blockchain wallets via thirdweb SDK (ERC-20/721), and work with DatoCMS, OAuth 2.0 providers (Google, Microsoft, Yahoo), and the OpenAI API.",
      "description_short": "Firebase, MongoDB, MySQL, PostgreSQL, Redis, Oracle. REST APIs, GraphQL, blockchain, OAuth integration.",
      "usages": [
        {
          "company": "Konvi",
          "period": "2025 - Present",
          "detail": "Managing Firebase for authentication and real-time data. Integrated GraphQL APIs with full type safety. Implemented blockchain integrations using thirdweb SDK for ERC-20/721 token interactions. Configured OAuth 2.0 with Google, Microsoft, and Yahoo providers. Integrated DatoCMS for dynamic content management with GraphQL."
        },
        {
          "project": "Bazinga - LLM Developer",
          "period": "2019 - Present",
          "detail": "Modeled data with Prisma on MongoDB. Handled schema sync via prisma db push. Designed entities for User, Job, and generated CV/Cover Letter outputs. Integrated OpenAI API for intelligent document generation. Created downloadable PDF outputs from generated content."
        },
        {
          "company": "Blocworx",
          "period": "Nov 2020 - May 2024",
          "detail": "Designed and maintained REST APIs for complex no-code platform workflows. Integrated MongoDB with Mongoose for data modeling. Built comprehensive API documentation. Worked with third-party integrations for high-traffic enterprise operations."
        },
        {
          "company": "Monsoon Consulting",
          "period": "Apr 2019 - May 2020",
          "detail": "Conducted performance audits identifying database bottlenecks. Designed and implemented custom REST APIs for Magento integration. Analyzed third-party integrations (e.g., Nosto) and delivered optimization recommendations."
        },
        {
          "company": "Captura.Me",
          "period": "Dec 2012 - Sep 2016",
          "detail": "Built REST APIs with Axios integration. Managed database operations with MySQL. Implemented caching strategies for performance optimization. Applied pagination and query optimization techniques."
        }
      ],
      "relatedSkills": ["GraphQL", "REST APIs", "MongoDB", "PostgreSQL", "Firebase", "Prisma", "OpenAI API"]
    }
  ],
  "experience": [
    {
      "company": "Konvi",
      "location": "Dublin",
      "role": "Software Engineer",
      "period": "2025 to present",
      "technologies": ["React 18", "React Native", "Next.js 13/14", "Expo", "TypeScript 5+", "GraphQL", "Firebase", "thirdweb", "DatoCMS"]
    },
    {
      "company": "Blocworx",
      "location": "Cork",
      "role": "Senior Angular Developer",
      "period": "Nov 2020 to May 2024",
      "technologies": ["Angular 19", "React", "Laravel", "Node.js", "Python", "Bash", "Docker", "Jest", "Puppeteer", "Chart.js"]
    },
    {
      "company": "Monsoon Consulting",
      "location": "Dublin",
      "role": "Fullstack Developer, Magento I and II",
      "period": "Apr 2019 to May 2020",
      "technologies": ["Magento 1", "Magento 2", "PHP", "Docker", "Webpack", "REST APIs"]
    },
    {
      "company": "StudioForty9",
      "location": "Cork",
      "role": "Full-stack Developer, Magento I",
      "period": "Sep 2016 to Dec 2018",
      "technologies": ["Magento 1", "PHP", "Docker", "Google Analytics", "SEO"]
    },
    {
      "company": "Captura.Me",
      "location": "João Pessoa",
      "role": "Full Stack Zend and React",
      "period": "Dec 2012 to Sep 2016",
      "technologies": ["Zend Framework II", "React", "React Router", "Context API", "REST APIs", "Axios"]
    },
    {
      "company": "Vox Technology",
      "location": "João Pessoa",
      "role": "Backend Developer",
      "period": "Aug 2011 to Nov 2012",
      "technologies": ["Zend Framework I", "PHP", "jQuery", "Git"]
    },
    {
      "company": "Dantel",
      "location": "João Pessoa",
      "role": "Full-stack YII Developer",
      "period": "Aug 2011 to Nov 2012",
      "technologies": ["YII", "Ext JS", "JavaScript", "PHP"]
    },
    {
      "company": "Dataprev",
      "location": "João Pessoa",
      "role": "Full Stack Java Developer",
      "period": "Apr 2009 to Apr 2010",
      "technologies": ["Java", "Netuno Framework", "Big Data"]
    }
  ],
  "education": {
    "institution": "IESP",
    "location": "João Pessoa",
    "degree": "Bachelor's degree: Information Technology",
    "period": "Oct 2007 - Oct 2011",
    "highlights": ["Built 20+ 2D games with Python/Pygame (Firestorm team)", "Active in Free Software groups (GLUGPB & CETI)", "Promoted open-source culture through tech talks"]
  },
  "concepts": [
    "Architecture",
    "Code Review",
    "Component Development",
    "Design Patterns",
    "Object-Oriented Programming",
    "Performance Optimisation",
    "Refactoring",
    "REST & GraphQL",
    "Agile Practices",
    "CI/CD Pipelines",
    "Cross-platform Development",
    "Blockchain Integrations",
    "Responsive Design Systems",
    "Figma-to-Code",
    "Type Safety",
    "Test-Driven Development",
    "Package Maintenance (Monorepos)"
  ],
  "programmingLanguages": [
    { "name": "TypeScript", "color": "#3178c6" },
    { "name": "JavaScript", "color": "#f1e05a" },
    { "name": "Python", "color": "#3572A5" },
    { "name": "PHP", "color": "#4F5D95" },
    { "name": "Java", "color": "#b07219" },
    { "name": "Bash", "color": "#89e051" },
    { "name": "Ruby", "color": "#701516" },
    { "name": "C#", "color": "#178600" }
  ],
  "managedWebsites": [
    "https://www.centralbank.ie",
    "https://store.liverpoolfc.com",
    "https://www.blocworx.com",
    "https://www.mcelhinneys.com",
    "https://www.strubloid.com",
    "https://www.monsoonconsulting.com"
  ]
}
